picturesque/app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = ? LIMIT 1  [["id", 1]]

  def create
    # @gallery = Gallery.new(params[:gallery])
    @gallery=Gallery.new(gallery_params)
    if @gallery.save
---
INSERT INTO "galleries" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-02-28 17:11:08.109737"], ["name", "test"], ["updated_at", "2015-02-28 17:11:08.109737"]]