picturesque/app/controllers/paintings_controller.rb

INSERT INTO "paintings" ("created_at", "gallery_id", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-28 17:11:41.757659"], ["gallery_id", 1], ["image", "IMG_0001.jpg"], ["name", "test"], ["updated_at", "2015-02-28 17:11:41.757659"]]
---
  def create
    @painting = Painting.new(painting_params)
    if @painting.save

SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @painting = Painting.find(params[:id])